{"format": "graph-model", "generatedBy": "2.20.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "561"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "561"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "561"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/Shape", "op": "Shape", "input": ["input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/transpose", "op": "Transpose", "input": ["input", "StatefulPartitionedCall/har_gru_inference_1/gru_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/Shape", "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice/stack", "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice/stack_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/transpose", "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice", "StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros/packed", "StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21", "op": "NoOp", "input": ["^StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_13", "op": "Enter", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/Max", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_12", "op": "Enter", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/loop_counter", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/time", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_18", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_19", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_20", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopControlInputs/_21"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvaGFyX2dydV9pbmZlcmVuY2VfMS9ncnVfMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_23", "op": "Merge", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_13", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_44"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_17", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_48"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_25", "op": "Merge", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_15", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_46"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_22", "op": "Merge", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_12", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_43"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_16", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_47"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_24", "op": "Merge", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_14", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_45"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/input_control_node/_49", "op": "NoOp", "input": ["^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_18", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_19", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_20", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_22", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_23", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_24", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_25", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_26", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_27"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/har_gru_inference_1/gru_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_22", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_23", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/input_control_node/_49"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/har_gru_inference_1/gru_1/while/Less/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/input_control_node/_49"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/har_gru_inference_1/gru_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_24", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/har_gru_inference_1/gru_1/while/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/har_gru_inference_1/gru_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/har_gru_inference_1/gru_1/while/Less_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/har_gru_inference_1/gru_1/while/Less"]}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopCond/_28", "op": "LoopCond", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/cond/_10/har_gru_inference_1/gru_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1_switch/_32", "op": "Switch", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_25", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopCond/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/loop_counter_switch/_29", "op": "Switch", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_22", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopCond/_28"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_34", "op": "Switch", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_27", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopCond/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/time_switch/_31", "op": "Switch", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_24", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopCond/_28"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros_switch/_33", "op": "Switch", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_26", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopCond/_28"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/Max_switch/_30", "op": "Switch", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/merge/_23", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/LoopCond/_28"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_39", "op": "Exit", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1_switch/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_36", "op": "Exit", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/loop_counter_switch/_29"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/loop_body_control/_35", "op": "Identity", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/loop_counter_switch/_29:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_41", "op": "Exit", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_38", "op": "Exit", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/time_switch/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_40", "op": "Exit", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros_switch/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_37", "op": "Exit", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/Max_switch/_30"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_39", "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60", "op": "NoOp", "input": ["^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/Max_switch/_30", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_34", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1_switch/_32", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/time_switch/_31", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/loop_body_control/_35", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros_switch/_33", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_18", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_19", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_20"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice_3/stack", "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice_3/stack_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/sub/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/split_1/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Squeeze", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_18"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_1/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_1/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_1/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Squeeze_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_18"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_2/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_2/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_2/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_19", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "561"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_20", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/strided_slice_3", "StatefulPartitionedCall/har_gru_inference_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/har_gru_inference_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/loop_counter_switch/_29:1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/time_switch/_31:1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_34:1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/time_switch/_31:1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros_switch/_33:1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Cast_1/ReadVariableOp", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Squeeze_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/output_control_node/_79", "op": "NoOp", "input": ["^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_18"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/enter/_18"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/output_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/har_gru_inference_1/dense_1/Relu", "StatefulPartitionedCall/har_gru_inference_1/output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/har_gru_inference_1/output_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Squeeze"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice/stack", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice/stack_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "3"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_1/stack", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_1/stack_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_2/stack", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_2/stack_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_48", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayUnstack/TensorListFromTensor_switch/_34:1", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/output_control_node/_79", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_44", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/Max_switch/_30:1", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/NoOp", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/input_control_node/_60"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_43", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/add_1", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_45", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/add", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/har_gru_inference_1/output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/split_1", "op": "Split", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/split_1/split_dim", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add"], "attr": {"num_split": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/har_gru_inference_1/output_1/Softmax", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_40", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_39", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_38", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_41", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_36", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/exit/_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/split_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/split_1:1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Sigmoid", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/zeros_switch/_33:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/sub/x", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Sigmoid_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/strided_slice_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/split_1:2", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/sub", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_5", "op": "AddV2", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/mul_1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2_1_switch/_32:1", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/TensorArrayV2Write/TensorListSetItem/index", "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_5"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_47", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/gru_cell_1/add_5", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/while/next_iteration/_46", "op": "NextIteration", "input": ["StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/output_control_node/_79", "^StatefulPartitionedCall/har_gru_inference_1/gru_1/while/body/_11/har_gru_inference_1/gru_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/har_gru_inference_1/gru_1/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": 